Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70J21.xml
        <register caption="Interrupt Disable Register" name="AES_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Disable" mask="0x00010000" name="TAGRDY"/>
        </register>
        <register caption="Interrupt Mask Register" name="AES_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Mask" mask="0x00010000" name="TAGRDY"/>
        </register>
        <register caption="Interrupt Status Register" name="AES_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready (cleared by setting bit START or bit SWRST in AES_CR or by reading AES_ODATARx)" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Status (cleared by writing SWRST in AES_CR)" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access (cleared by writing SWRST in AES_CR)" mask="0x0000F000" name="URAT" values="AES_ISR__URAT"/>
          <bitfield caption="GCM Tag Ready" mask="0x00010000" name="TAGRDY"/>
        </register>
        <register caption="Key Word Register 0" name="AES_KEYWR0" offset="0x20" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 1" name="AES_KEYWR1" offset="0x24" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 2" name="AES_KEYWR2" offset="0x28" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 3" name="AES_KEYWR3" offset="0x2C" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 4" name="AES_KEYWR4" offset="0x30" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 5" name="AES_KEYWR5" offset="0x34" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 6" name="AES_KEYWR6" offset="0x38" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 7" name="AES_KEYWR7" offset="0x3C" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Input Data Register 0" name="AES_IDATAR0" offset="0x40" rw="W" size="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data Register 1" name="AES_IDATAR1" offset="0x44" rw="W" size="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data Register 2" name="AES_IDATAR2" offset="0x48" rw="W" size="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data Register 3" name="AES_IDATAR3" offset="0x4C" rw="W" size="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Output Data Register 0" name="AES_ODATAR0" offset="0x50" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Output Data Register 1" name="AES_ODATAR1" offset="0x54" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Output Data Register 2" name="AES_ODATAR2" offset="0x58" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Output Data Register 3" name="AES_ODATAR3" offset="0x5C" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Initialization Vector Register 0" name="AES_IVR0" offset="0x60" rw="W" size="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
        <register caption="Initialization Vector Register 1" name="AES_IVR1" offset="0x64" rw="W" size="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
        <register caption="Initialization Vector Register 2" name="AES_IVR2" offset="0x68" rw="W" size="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
        <register caption="Initialization Vector Register 3" name="AES_IVR3" offset="0x6C" rw="W" size="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
        <register caption="Additional Authenticated Data Length Register" name="AES_AADLENR" offset="0x70" rw="RW" size="4">
          <bitfield caption="Additional Authenticated Data Length" mask="0xFFFFFFFF" name="AADLEN"/>
        </register>
        <register caption="Plaintext/Ciphertext Length Register" name="AES_CLENR" offset="0x74" rw="RW" size="4">
          <bitfield caption="Plaintext/Ciphertext Length" mask="0xFFFFFFFF" name="CLEN"/>
        </register>
        <register caption="GCM Intermediate Hash Word Register 0" name="AES_GHASHR0" offset="0x78" rw="RW" size="4">
          <bitfield caption="Intermediate GCM Hash Word x" mask="0xFFFFFFFF" name="GHASH"/>
        </register>
        <register caption="GCM Intermediate Hash Word Register 1" name="AES_GHASHR1" offset="0x7C" rw="RW" size="4">
          <bitfield caption="Intermediate GCM Hash Word x" mask="0xFFFFFFFF" name="GHASH"/>
        </register>
        <register caption="GCM Intermediate Hash Word Register 2" name="AES_GHASHR2" offset="0x80" rw="RW" size="4">
          <bitfield caption="Intermediate GCM Hash Word x" mask="0xFFFFFFFF" name="GHASH"/>
        </register>
