Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70J21.xml
        <register caption="Host Pipe Mask Register (n = 0) 4" name="USBHS_HSTPIPIMR4" offset="0x5D0" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 5" name="USBHS_HSTPIPIMR5" offset="0x5D4" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 6" name="USBHS_HSTPIPIMR6" offset="0x5D8" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 7" name="USBHS_HSTPIPIMR7" offset="0x5DC" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 8" name="USBHS_HSTPIPIMR8" offset="0x5E0" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 9" name="USBHS_HSTPIPIMR9" offset="0x5E4" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
