Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70J21.xml
      <value-group caption="" name="USBHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
